In [16]:
import pandas as pd
list1 = [1000,1188,5567]
list2 = [1212,3454,6543]
list3 = [3432,9087,6789]
list4 = [1234,4567,9876]


ind = ["Karachi","Lahore","Islamabad","Quetta"]
col = ["Population","Universities","Schools"]
df = pd.DataFrame([list1,list2,list3,list4],index=ind,columns=col)
df

           Population  Universities  Schools
Karachi          1000          1188     5567
Lahore           1212          3454     6543
Islamabad        3432          9087     6789
Quetta           1234          4567     9876

In [18]:
df.Population

Karachi      1000
Lahore       1212
Islamabad    3432
Quetta       1234
Name: Population, dtype: int64

In [19]:
df.Universities

Karachi      1188
Lahore       3454
Islamabad    9087
Quetta       4567
Name: Universities, dtype: int64

In [20]:
df.Schools #way 1 to access columns!

Karachi      5567
Lahore       6543
Islamabad    6789
Quetta       9876
Name: Schools, dtype: int64

In [21]:
df["Schools"] #way 2 to access columns!

Karachi      5567
Lahore       6543
Islamabad    6789
Quetta       9876
Name: Schools, dtype: int64

In [24]:
df[["Schools","Universities"]] #ager aik se zyada columns ko access krna hai tou aik list deni hogi df[] k subscript main!

           Schools  Universities
Karachi       5567          1188
Lahore        6543          3454
Islamabad     6789          9087
Quetta        9876          4567